
# 普通数据
d1 = {"名称": "商品A", "价格": 80, "数量": 2}
d2 = {"姓名": "小明", "年龄": 22, "成绩": 90}
l1 = ["商品1","商品2","商品3","商品4"]
l2 = ["学生1","学生2","学生3","学生4"]

# 嵌套数据展示
products = [
    {"名称": "商品A", "价格": 80, "数量": 2},
    {"名称": "商品B", "价格": 120, "数量": 1},
    {"名称": "商品C", "价格": 50, "数量": 3},
    {"名称": "商品D", "价格": 150, "数量": 1}
]
students = [
    {"姓名": "小明", "年龄": 22, "成绩": 90},
    {"姓名": "小红", "年龄": 19, "成绩": 85},
    {"姓名": "小刚", "年龄": 23, "成绩": 92},
    {"姓名": "小丽", "年龄": 21, "成绩": 88}
]

# 复杂数据展示
stores = [
    {
        "名称": "商店A",
        "商品列表": [
            {"名称": "商品1", "价格": 40, "库存": 5},
            {"名称": "商品2", "价格": 60, "库存": 15},
            {"名称": "商品3", "价格": 30, "库存": 20}
        ]
    },
    {
        "名称": "商店B",
        "商品列表": [
            {"名称": "商品4", "价格": 20, "库存": 8},
            {"名称": "商品5", "价格": 45, "库存": 12},
            {"名称": "商品6", "价格": 10, "库存": 30}
        ]
    }
]

sales_records = [
    {
        "商店名称": "商店A",
        "销售员": "张三",
        "销售日期": "2023-03-01",
        "销售金额": 0,  # 这个键初始化为0，程序将计算实际销售金额
        "销售商品列表": [
            {"商品名称": "商品1", "单价": 50, "数量": 2},
            {"商品名称": "商品2", "单价": 30, "数量": 3}
        ]
    },
    {
        "商店名称": "商店B",
        "销售员": "李四",
        "销售日期": "2023-03-02",
        "销售金额": 0,  # 这个键初始化为0，程序将计算实际销售金额
        "销售商品列表": [
            {"商品名称": "商品3", "单价": 80, "数量": 1},
            {"商品名称": "商品4", "单价": 40, "数量": 4}
        ]
    }
]