# https://steam.oxxostudio.tw/category/python/index.html
"""
**********************************************
~~A 資料型別                                ***
        【A01】   變數  variable            ***
        【A02】   變數(全域、區域)            ***
        【A03】   數字  number              ***
        【A04】   文字與字串   (string)      ***
        【A05】   文字與字串   (常用方法)      ***
        【A06】   文字與字串   (格式化)       ***
        【A07】   串列  list                ***
        【A08】   串列  (常用方法)            ***
        【A09】   元組/數組  tuple           ***
        【A10】   字典      dictionary      ***
        【A11】   集合      set             ***
**********************************************
"""
