"""
todo    A:數值類型與序列類型

A1: 變量
    一、變量
        1.  編程中用於存儲數據的容器
    二、如何創建變量
        1.  語法:變量名    =   值
        2.  使用    =   賦值符號，進行變量賦值
        3.  取一個變量名。
            【命名規則：只能有數字、字母、底線組成，並且不能以數字開頭，
            不建議以底線開頭，也不建議包含中文
    三、如何查看變量中具體值得數據類型?
        1.  type(值) :    用於查看數據類型的一個功能函數，這個函數被使用後有返回值得。
A2: 變量與數值類型
    一、  整數類型    --int
    二、  小數類型    --float
    三、  複數類型    --complex
    四、  布林類型    --bool

A3: 序列類型

A4: 索引和切片


"""
class A():
    def a1(self):
        _url1 = 10    #
        url你好 = 10
        print(f"{_url1} \t  型態{type(_url1)}")
    def a2(self):
        i
A().a1()


"""
todo    B:序列類型的方法

B1: 列表的操作方法

B2: 元祖的操作方法

B3: 字符串的操作方法


"""

"""
todo    C:自符串處理  

C1:  轉譯

C2: 格式化輸出

C3: 編碼規則

"""

"""
todo    D:散列類型

D1: 集合

D2: 字典

D3: 常見數據展示

D4: 集合唯一應用


"""

"""
todo   E: 控制類型

E1: 條件表達式
E2: 分支結構
E3: 分支結構實戰-計算器
E4: for 循環
E5: while   循環
E6: 循環終止關鍵詞
E7: 控制流程實戰-驗證碼
"""

"""
todo    F:控制流程應用
F1: break   和   continue   
F2: 分支結構嵌套
F3: 循環嵌套
F4: 循環與分支結構嵌套
"""


"""
todo    G:初識函數
G1: 函數語法
G2: 函數不同的寫法
G3: 函數的參數解說
G4: 其他頁面遊戲調用案例

"""

"""
todo    H:函數作用域及匿名函數
H1: 函數調用
H2: 全局變量與局部變量
H3: 匿名函數
H4: 回調函數
H5: 閉包
"""

"""
todo    I:類和對象
I1: 認識類別
I2: 面向對象
I3: 初始化方法
I4: 認識類案例升級
I5: 認識類案例再升級

"""

"""
todo    J:封裝和繼承
J1: 私有化
J2: 繼承
J3: 多繼承
J4: 繼承重寫
J5: 私有化擴展
"""


"""
todo    K:魔法方法與裝飾器
K1: 魔法方法
K2: 裝飾器
K3: 裝氣器理解加案例

"""

"""
todo    L:文件操作
L1: 普通文件操作
L2: 普通文件操作升級
L3: 媒體文件操作
L4: os庫
"""

"""
todo    M:異常
M1: 復現異常
M2: 異常捕捉
M3: 異常傳遞
M4: 自訂義異常
"""

"""
todo    N:正則表達式
N1: 認識re庫
N2: 正則六部曲

"""
