sel_dict = {
    "姓名":"林里",
    "年龄":18,
    "城市":"广州"
}
# 一、查指定key值
# 语法2：字典名[键]   获取指定key对应的 值 ; 若不存在则报错KeyError
y = sel_dict["城市"]
print(y)

# 字典是无序的，这个无序体现在没有下标
# 字典取值是需要通过键取值，这个键类似于下标（索引）

# 字典变量名[键]
x = sel_dict["年龄"]
print(x)
print("---------------------------------------")
# 拓展：字典能否直接通过键名修改数据？
sel_dict["年龄"] = 19
print(sel_dict)

li = ["林里",18,"广州"]
#       0    1   2
# 列表变量名[下标]
z = li[1]
print(z)
print("---------------------------------------")
# 在列表中如果要对列表中的数据进行修改，可以直接通过下标去定位到数据进行修改
li[1] = 19
print(li)