"""
分支结构（逻辑判断判断）
一、关键词：
    if 如果    else否则     elif否则如果

二、分支结构理解：
如果今天是星期天，那么我们可以在家休息，否则我们需要去上班。
如果今天是晴天，那么我们可以出去打篮球，否则如果今天是阴天，我们可以出去踏青，否则我们就在家里看
电影。

三、语法结构：
    1、单分支结构：
        if 条件表达式：
            代码块（满足条件才执行的）

    2、二分支结构：
        if 条件表达式：
            代码块（满足条件才执行的）
        else:
            代码块（不满足条件才执行）

    3、多分支结构：
        if 条件表达式1：
            代码块（满足条件才执行的）
        elif 条件表达式2:
            代码块（满足条件才执行的）
        elif 条件表达式3:
            代码块（满足条件才执行的）
        else:
            代码块（不满足条件才执行）
"""


"""
实战练习:
帮助老师去实现编写一个小程序，判断同学们的成绩是否合格
需求1、模拟用户输入成绩的功能
提示: 使用input 输入函数，用于接受用户从控制台输入的内，！！！！接受的内容默认为字符串格式
需求2、根据条件进行验证，验证条件：   <60 不及格 ,  >=60 并且 <= 80 是良好 ,  >80 并且 <100 是优秀 ，以上都不满足 是成绩异常，需要用户再次输入
"""









